granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
static void             http_json_ok ();
static uint_fast8_t     http_get_on_off_value (const char * param, uint_fast8_t current_value);
static int              http_api_stm32_log ();
static int              http_api_stm32_log_clear ();

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * flush output buffer
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_flush (void)
{
    if (http_response_len > 0)
    {
        http_client.print (http_response);
        http_client.flush ();
        http_response[0] = '\0';
        http_response_len = 0;
    }
}

static void
http_concat_response (const char * s, int len)
{
    strncpy (http_response + http_response_len, s, len);
    http_response_len += len;
    http_response[http_response_len] = '\0';
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * send string
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_send (const char * s)
{
    int len = strlen (s);

    while (http_response_len + len > MAX_HTTP_RESPONSE_LEN)
    {
        int rest = MAX_HTTP_RESPONSE_LEN - http_response_len;

        http_concat_response (s, rest);
        http_flush ();

        len -= rest;
        s += rest;
    }

    http_concat_response (s, len);
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * send string
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_send (String s)
{
    http_send (s.c_str());
}

static void
http_send_json_escaped (const char * s)
{
    while (s && *s)
    {
        char ch = *s++;

        switch (ch)
        {
            case '\\':
                http_send (FS("\\\\"));
                break;
            case '"':
                http_send (FS("\\\""));
                break;
            case '\r':
                http_send (FS("\\r"));
                break;
            case '\n':
                http_send (FS("\\n"));
                break;
            case '\t':
                http_send (FS("\\t"));
                break;
            default:
            {
                char buffer[2];

                buffer[0] = ch;
                buffer[1] = '\0';
                http_send (buffer);
                break;
            }
        }
    }
}

static const char *
http_content_type (const char * path)
{
    const char * p = strrchr (path, '.');

    if (! p)
    {
        return "text/plain";
    }

    if (! strcmp (p, ".html"))
    {
        return "text/html; charset=utf-8";
    }
    else if (! strcmp (p, ".css"))
    {
        return "text/css; charset=utf-8";
    }
    else if (! strcmp (p, ".js"))
    {
        return "application/javascript; charset=utf-8";
    }
    else if (! strcmp (p, ".webmanifest"))
    {
        return "application/manifest+json; charset=utf-8";
    }
    else if (! strcmp (p, ".json"))
    {
        return "application/json; charset=utf-8";
    }
    else if (! strcmp (p, ".svg"))
    {
        return "image/svg+xml";
    }
    else if (! strcmp (p, ".png"))
    {
        return "image/png";
    }
    else if (! strcmp (p, ".ico"))
    {
        return "image/x-icon";
    }

    return "text/plain";
}

static uint_fast8_t
http_send_fs_file (const char * filename, const char * content_type)
{
    uint_fast8_t    rtc = 0;

    LittleFS.begin ();

    if (LittleFS.exists (filename))
    {
        File fp = LittleFS.open (filename, "r");

        if (fp)
        {
            http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: "));
            http_send (content_type);
            http_send (FS("\r\nCache-Control: no-cache\r\n\r\n"));

            while (fp.available ())
            {
                char    buf[257];
                size_t  len = fp.readBytes (buf, sizeof (buf) - 1);

                if (len > 0)
                {
                    buf[len] = '\0';
                    http_send (buf);
                }
            }

            fp.close ();
            http_flush ();
            rtc = 1;
        }
    }

    LittleFS.end ();
    return rtc;
}

static bool
app_asset_filename (const char * asset_path, char * filename, size_t maxlen)
{
    size_t idx = 0;

    if (! asset_path || ! *asset_path)
    {
        return false;
    }

    for (const char * p = asset_path; *p && idx < maxlen - 1; p++)
    {
        if (*p == '/')
        {
            filename[idx++] = '-';
        }
        else
        {
            filename[idx++] = *p;
        }
    }

    filename[idx] = '\0';
    return idx > 0;
}

static uint_fast8_t
http_app (const char * path)
{
    char            filename[128];
    const char *    content_type;
    uint_fast8_t    is_pwa_index = 0;

    if (! strcmp (path, PWA_PREFIX) || ! strcmp (path, PWA_PREFIX "/"))
    {
        strncpy (filename, PWA_INDEX_FILE, sizeof (filename) - 1);
        filename[sizeof (filename) - 1] = '\0';
        is_pwa_index = 1;
    }
    else if (! strncmp (path, PWA_PREFIX "/", strlen (PWA_PREFIX "/")))
    {
        char asset_path[128];

        snprintf (asset_path, sizeof (asset_path), "app/%s", path + strlen (PWA_PREFIX "/"));

        if (! app_asset_filename (asset_path, filename, sizeof (filename)))
        {
            http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\n\r\nPWA asset not found\r\n"));
            http_flush ();
            return 0;
        }
    }
    else
    {
        return 0;
    }

    content_type = http_content_type (filename);

    if (! http_send_fs_file (filename, content_type))
    {
        if (is_pwa_index)
        {
            http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: text/html; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));
            http_send (FS(
                "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                "<meta name='viewport' content='width=device-width, initial-scale=1'>"
                "<title>WordClock App noch nicht installiert</title>"
                "<style>"
                "body{font-family:Arial,sans-serif;background:#0b1422;color:#eef4ff;padding:24px;line-height:1.5;}"
                ".card{max-width:680px;margin:0 auto;background:#132033;border:1px solid rgba(255,255,255,.08);"
                "border-radius:18px;padding:24px;box-shadow:0 20px 50px rgba(0,0,0,.25);}"
                "h1{margin:0 0 12px;font-size:28px;}p{color:#c5d3ea;}a{display:inline-block;margin:8px 12px 0 0;"
                "padding:12px 16px;border-radius:999px;text-decoration:none;background:#2d5275;color:#fff;"
                "border:1px solid rgba(255,255,255,.15);}strong{color:#fff;}"
                "</style></head><body><div class='card'>"
                "<h1>WordClock App ist noch nicht installiert</h1>"
                "<p>Auf diesem Gerät wurden noch keine App-Dateien in das LittleFS geladen.</p>"
                "<p><strong>Weiter so:</strong> App-Paket über die Legacy-Seite installieren oder vom Update-Server laden.</p>"
                "<a href='/fs'>Zu Dateien / App-Paket</a>"
                "<a href='/update'>Zu Update</a>"
                "<a href='/'>Zur Legacy-Seite</a>"
                "</div></body></html>"
            ));
        }
        else
        {
            http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\n\r\nPWA asset not found\r\n"));
        }
        http_flush ();
    }

