granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            if (c >= 0 && c != '\n' && c != '\r')
            {
                line += (char) c;
            }
        }
        else
        {
            if ((millis() - start_millis) >= READ_LINE_TIMEOUT)
            {
                rtc = false;
                break;
            }
        }
    } while (c >= 0 && c != '\r');

    yield();
    return (rtc);
}

static bool
read_post_headers (size_t * content_length)
{
    String line;

    *content_length = 0;

    while (read_line (line))
    {
        if (line == "")
        {
            if (http_client.available () && http_client.peek () == '\n')
            {
                http_client.read ();
            }
            return true;
        }
        else if (line.startsWith ("Content-Length:"))
        {
            *content_length = (size_t) strtoul (line.substring (15).c_str (), NULL, 10);
        }
    }

    return false;
}

static bool
read_request_body_to_file (File& f, size_t content_length)
{
    unsigned long start_millis = millis ();

    while (content_length > 0)
    {
        if (http_client.available ())
        {
            uint8_t buf[256];
            size_t  chunk = http_client.available ();

            if (chunk > sizeof (buf))
            {
                chunk = sizeof (buf);
            }

            if (chunk > content_length)
            {
                chunk = content_length;
            }

            int n = http_client.read (buf, chunk);

            if (n > 0)
            {
                f.write (buf, n);
                content_length -= n;
                start_millis = millis ();
                yield ();
            }
        }
        else if ((millis () - start_millis) >= READ_BODY_TIMEOUT)
        {
            return false;
        }
    }

    return true;
}

static size_t
read_request_body_to_update (size_t content_length)
{
    size_t written = 0;
    unsigned long start_millis = millis ();

    while (written < content_length)
    {
        if (http_client.available ())
        {
            uint8_t buf[256];
            size_t  chunk = http_client.available ();

            if (chunk > sizeof (buf))
            {
                chunk = sizeof (buf);
            }

            if (chunk > content_length - written)
            {
                chunk = content_length - written;
            }

            int n = http_client.read (buf, chunk);

            if (n > 0)
            {
                size_t just_written = Update.write (buf, n);

                if (just_written != (size_t) n)
                {
                    return written + just_written;
                }

                written += just_written;
                start_millis = millis ();
                yield ();
            }
        }
        else if ((millis () - start_millis) >= READ_BODY_TIMEOUT)
        {
            return written;
        }
    }

    return written;
}

static size_t
skip_leading_body_newlines (void)
{
    size_t skipped = 0;
    unsigned long start_millis = millis ();

    while ((millis () - start_millis) < READ_BODY_TIMEOUT)
    {
        if (http_client.available ())
        {
            int ch = http_client.peek ();

            if (ch == '\r' || ch == '\n')
            {
                http_client.read ();
                skipped++;
                continue;
            }
            break;
        }
    }

    return skipped;
}

static bool
fs_read_line (File& fp, String& line)
{
    int c;

    line = "";

    while ((c = fp.read ()) >= 0)
    {
        if (c == '\r')
        {
            continue;
        }
        else if (c == '\n')
        {
            return true;
        }

        line += (char) c;
    }

    return line.length () > 0;
}

static int
install_app_bundle (const char * bundle_filename)
{
    int     rtc = 0;
    String  line;

    LittleFS.begin ();

    File bundle = LittleFS.open (bundle_filename, "r");

    if (bundle)
    {
        File out = (File) 0;

        if (LittleFS.exists ("app"))
        {
            LittleFS.remove ("app");
        }

        if (fs_read_line (bundle, line) && line == "WCAPPBUNDLE 1")
        {
            rtc = 1;

            while (fs_read_line (bundle, line))
            {
                if (line == "END_BUNDLE")
                {
                    break;
                }
                else if (line.startsWith ("FILE "))
                {
                    String fname = line.substring (5);
                    char   flat_fname[128];

                    if (out)
                    {
                        out.close ();
                    }

                    if (! fname.startsWith ("app/"))
                    {
                        rtc = 0;
                        break;
                    }

                    if (! app_asset_filename (fname.c_str(), flat_fname, sizeof (flat_fname)))
                    {
                        rtc = 0;
                        break;
                    }

                    out = LittleFS.open (flat_fname, "w+");

                    if (! out)
                    {
                        rtc = 0;
                        break;
                    }
                }
                else if (line == "END_FILE")
                {
                    if (out)
                    {
                        out.close ();
                    }
                }
                else
                {
                    if (! out)
                    {
                        rtc = 0;
                        break;
                    }

                    out.write ((const uint8_t *) line.c_str (), line.length ());
                    out.write ('\n');
                }

                yield ();
            }

            if (out)
            {
                out.close ();
            }
        }

        bundle.close ();
        LittleFS.remove (bundle_filename);
    }

    LittleFS.end ();
    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * LittleFS page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define FSINFO_HEADER_COLS      2
#define DIRECTORY_HEADER_COLS   2

#define POST_ICON_NONE            0
#define POST_ICON_FILE            1
#define POST_ICON_WEATHER_FILE    2
#define POST_TABLES_FILE          3
#define POST_DISPLAY_FILE         4
#define POST_APP_BUNDLE_FILE      5

