granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            if (fname_weather)
            {
                download_rtc = download_file (update_host, update_path, fname_weather);
            }

            LittleFS.end ();
        }
        else if (! strcmp (action, "dwnappbundle"))
        {
            LittleFS.begin ();
            download_rtc = download_file (update_host, update_path, APP_BUNDLE_FILENAME);
            LittleFS.end ();

            if (download_rtc == 1)
            {
                app_bundle_rtc = install_app_bundle (APP_BUNDLE_FILENAME);
            }
        }
        else if (! strcmp (action, "remove"))
        {
            char * fname = http_get_param ("filename");
            LittleFS.begin ();
            LittleFS.remove (fname);
            LittleFS.end ();
        }
        else if (! strcmp (action, "show"))
        {
            show_fname = http_get_param ("filename");
        }
    }

    http_header ("ESP8266 LittleFS", (const char *) NULL, (const char *) NULL);
    begin_box ("ESP8266 LittleFS");
    message_tables_file_missing ();

    if (tables_corrupt)
    {
        http_send_FS ("<font color=\"red\"><B>table file wcxx-tables-xx.txt is corrupt. Remove it, load it again or format LittleFS!</B></font><P>\r\n");
    }

    if (download_rtc == 0)
    {
        http_send_FS ("download failed<BR>");
    }
    else if (download_rtc == 1)
    {
        http_send_FS ("download successful<BR>");
    }

    if (app_bundle_rtc == 0)
    {
        http_send_FS ("WordClock App bundle installation failed<BR>");
    }
    else if (app_bundle_rtc == 1)
    {
        http_send_FS ("WordClock App bundle installed successfully<BR>");
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;
    sv = get_strvar (UPDATE_PATH_VAR);
    LittleFS.begin();

    table_header (fsinfo_cols, FSINFO_HEADER_COLS);

    if (LittleFS.info(fsinfo))
    {
        begin_table_row ();
        text_column ("Total bytes");
        sprintf (valbuf, "%d", fsinfo.totalBytes);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Used bytes");
        sprintf (valbuf, "%d", fsinfo.usedBytes);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Block size");
        sprintf (valbuf, "%d", fsinfo.blockSize);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Page size");
        sprintf (valbuf, "%d", fsinfo.pageSize);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Max open files");
        sprintf (valbuf, "%d", fsinfo.maxOpenFiles);
        text_rcolumn (valbuf);
        end_table_row ();

        begin_table_row ();
        text_column ("Max path length");
        sprintf (valbuf, "%d", fsinfo.maxPathLength);
        text_rcolumn (valbuf);
        end_table_row ();
    }

    table_trailer ();

    Dir dir = LittleFS.openDir("");
  
    table_header (directory_cols, DIRECTORY_HEADER_COLS);
  
    while (dir.next())
    {
        begin_table_row_form (thispage);

        begin_column ();
        http_send_FS ("<input type=\"text\" name=\"filename\" value=\"");
        http_send (dir.fileName());
        http_send_FS ("\" readonly>");
        end_column ();

        File f = dir.openFile ("r");
  
        if (f)
        {
            sprintf (valbuf, "%d", f.size());
            f.close ();
        }
        else
        {
            strcpy (valbuf, "unknown");
        }
  
        text_rcolumn (valbuf);
        button_column ("remove", "Remove");
        button_column ("show", "Show");
        end_table_row_form ();
    }

    table_trailer ();

    LittleFS.end ();
  
    http_send_FS ("<form method=\"GET\" action=\"/fs\">\r\n"
                  "<button type=\"submit\" name=\"action\" value=\"format\">Format ESP8266 LittleFS</button>"
                  "</form>");

    table_header (update_header_cols, UPDATE_HEADER_COLS);
    table_row_input (thispage, 3, "Update Host", "uphost", update_host, MAX_UPDATE_HOST_LEN);
    table_row_input (thispage, 3, "Update Path", "uppath", update_path, MAX_UPDATE_PATH_LEN);
#if 0
#define MAX_DOWNLOAD_FILENAME 32
    table_row_input (thispage, 3, "Download file", "dwnfil", "", MAX_DOWNLOAD_FILENAME);
#endif
    table_trailer ();

    http_send_FS ("<form method=\"GET\" action=\"/fs\">\r\n"
                  "    <button type=\"submit\" name=\"action\" value=\"download\">Download Icon files</button>\r\n"
                  "</form>\r\n");

    if (hardware_configuration != 0xFFFF && (hardware_configuration & HW_WC_MASK) != HW_UCLOCK)
    {
        http_send_FS ("<form method=\"GET\" action=\"/fs\">"
                      "<select id=\"tablefile\" name=\"tablefile\">");
    
        len = httpclient (update_host, update_path, WC_TABLES_LIST_TXT);
    
        if (len > 0)
        {
            char         fname[MAX_UPDATE_FILENAME_LEN];
            int          ch;
            int          l = 0;

            while (len > 0)
            {
                ch = httpclient_read (&len);

                if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
                {
                    fname[l++] = ch;
                }
                else if (ch == '\n')
                {
                    int show_option;

                    fname[l] = '\0';
                    l = 0;

                    show_option = 1;

                    if (tables_filter)
                    {
                        if (strncmp (fname, tables_filter, strlen (tables_filter)) != 0)
                        {
                            show_option = 0;
                        }
                    }

                    if (show_option)
                    {
                        char * p = tables_fname ();
                        http_send_FS ("<option value=\"");
                        http_send (fname);

                        if (p && ! strcmp (fname, p))
                        {
                            http_send_FS ("\" selected>");
                        }
                        else
                        {
                            http_send_FS ("\">");
                        }
                        http_send (fname);
                        http_send_FS ("</option>\r\n");
                    }
                }
            }

