granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            httpclient_stop ();
            http_flush ();
        }
        else
        {
           Serial.print("Error in HTTP request: ");
           Serial.println(WC_LIST_TXT);
        }

        http_send_FS ("</select>\r\n");

        http_send_FS ("<button type=\"submit\" name=\"action\" value=\"dwntable\">Download layout table</button>"
                      "</form>"
                      "<P>\r\n");
    }

    http_send_FS ("<table>");

    http_send_FS ("<tr><td colspan='3'><B>WordClock App bundle (/app)</B></td></tr>");
    http_send_FS ("<tr><td colspan='3'>Use app-bundle.txt for a single OTA upload, or download it directly from the configured update server above. Installed files appear as app-index.html, app-app.js, app-styles.css, app-manifest.webmanifest, app-sw.js and app-icons-*.svg in LittleFS.</td></tr>");
    if (app_bundle_available)
    {
        http_send_FS ("<tr><td colspan='3'>"
                      "<form method=\"GET\" action=\"/fs\" style=\"display:inline\">"
                      "<button type=\"submit\" name=\"action\" value=\"dwnappbundle\">Download WordClock App bundle</button>"
                      "</form>"
                      "</td></tr>");
    }
    http_send_FS ("<tr><td>app-bundle.txt</td><td>"
            "<form method='post' action='fs-app-bundle' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
            "<label class='custom-file-upload'><input type='file' name='fileField'>Bundle...</label>"
            "</td><td><input type='submit' class='button' name='submit' value='Install App'></td>"
            "</form></tr>"
            );

    if (fname_icon)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_icon);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-icon' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>"
                "</td><td><input type='submit' class='button' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

    if (fname_weather)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_weather);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-icon-weather' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>"
                "</td><td><input type='submit' class='button' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

    if (fname_tables)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_tables);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-tables' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>"
                "</td><td><input type='submit' class='button' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

    if (hardware_configuration != 0xFFFF && (hardware_configuration & HW_LED_MASK) == HW_LED_TFTLED_RGB_LED && fname_display)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_display);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-display' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>"
                "</td><td><input type='submit' class='button' name='submit' value='Upload'></td>"
                "</form></tr>"
                );
    }

    http_send_FS ("</table>");

    if (show_fname)
    {
        LittleFS.begin ();
        File fp = LittleFS.open(show_fname, "r");

        if (fp)
        {
            char  b[2];
            int   ch;

            b[1] = '\0';

            http_send (show_fname);
            http_send_FS (":<BR><pre>\r\n");

            while ((ch = fp.read ()) >= 0)
            {
                if (ch == '\r')
                {
                    http_send_FS ("&lt;CR&gt;");
                }
                else if (ch == '\n')
                {
                    http_send_FS ("&lt;LF&gt;\n");
                }
                else
                {
                    b[0] = ch;
                    http_send (b);
                }
            }

            fp.close ();
            http_send_FS ("</pre>\r\n");
        }
        LittleFS.end ();
    }
    end_box ();
    http_trailer ();
    http_flush ();
    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * HTTP update
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_update (void)
{
    const char *        thispage = "update";
    const char *        update_header_cols[UPDATE_HEADER_COLS]               = { "Name", "Value" };
    char *              action;
    char                flash_stm32_filename[MAX_UPDATE_FILENAME_LEN];
    char                stm32_default_filename[MAX_UPDATE_FILENAME_LEN];
    int                 do_update = 0;
    int                 do_reset = 0;
    STR_VAR *           sv;
    char *              version;
    char *              update_host;
    char *              update_path;
    char                flashsizebuf[32];
    uint32_t            flashsize;
    uint_fast8_t        rtc = 0;

    flash_stm32_filename[0] = '\0';

    sv              = get_strvar (VERSION_STR_VAR);
    version         = sv->str;

    flashsize = ESP.getFlashChipRealSize ();
    sprintf (flashsizebuf, "%d", flashsize);

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "update"))
        {
            do_update = 1;
        }
        else if (! strcmp (action, "saveuphost"))
        {
            set_strvar (UPDATE_HOST_VAR, http_get_param ("uphost"));
        }
        else if (! strcmp (action, "saveuppath"))
        {
            set_strvar (UPDATE_PATH_VAR, http_get_param ("uppath"));
        }
        else if (! strcmp (action, "flash"))
        {
            strncpy (flash_stm32_filename, http_get_param ("stm32_filenames"), 63);
            flash_stm32_filename[63] = '\0';
        }
        else if (! strcmp (action, "reset"))
        {
            do_reset = 1;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        set_strvar (UPDATE_HOST_VAR, DEFAULT_UPDATE_HOST);
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        set_strvar (UPDATE_PATH_VAR, DEFAULT_UPDATE_PATH);
    }

    if (do_update)
    {
        http_header ("Update", "40", "/update");
    }
    else if (do_reset)
    {
        http_header ("Update", "20", "/");
    }
    else
    {
        http_header ("Update", (const char *) NULL, (const char *) NULL);
    }

    begin_box ("Update");

    if (flashsize >= 4194304)
    {
        if (flash_stm32_filename[0])
        {
            int i;

            for (i = 0; i < 100; i++)
            {                                                   // send 1000 spaces to force Browser to begin rendering
                http_send ("          "); 
            }

            http_send_FS ("\r\n<P><B>Updating STM32 firmware...<BR>\r\n");
            http_flush ();

            Serial.print ("Flash STM32: http://");
            Serial.print (update_host);
            Serial.print ("/");
            Serial.print (update_path);
            Serial.print ("/");
            Serial.println (flash_stm32_filename);

            delay (200);
            stm32_flash_from_server (update_host, update_path, flash_stm32_filename);
            delay (200);
            Serial.println ("End of flashmode\r\n");
            Serial.flush ();

