granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
        if (tm)
        {
            sprintf (buff, FS("<tmvar idx=\"%d\" year=\"%d\" month=\"%d\" day=\"%d\" hour=\"%d\" minute=\"%d\" second=\"%d\" wday=\"%d\" />"),
                i,
                tm->tm_year + 1900,
                tm->tm_mon + 1,
                tm->tm_mday,
                tm->tm_hour,
                tm->tm_min,
                tm->tm_sec,
                tm->tm_wday);
            http_send (buff);
        }
    }

    // colors
    for (i = 0; i < MAX_DSP_COLOR_VARIABLES; i++)
    {
        sprintf(buff, FS("<dspcolor idx=\"%d\" red=\"%d\" green=\"%d\" blue=\"%d\" white=\"%d\" />"), i, dspcolorvars[i].red, dspcolorvars[i].green, dspcolorvars[i].blue, dspcolorvars[i].white);
        http_send(buff);
    }

    // num8 arrays
    for (i = 0; i < MAX_BRIGHTNESS + 1; i++)
    {
        sprintf(buff, FS("<num8array var=\"%d\" idx=\"%d\" value=\"%d\" />"), DISPLAY_DIMMED_DISPLAY_COLORS, i, get_num8_array(DISPLAY_DIMMED_DISPLAY_COLORS, i));
        http_send(buff);
    }

    for (i = 0; i < MAX_BRIGHTNESS + 1; i++)
    {
        sprintf(buff, FS("<num8array var=\"%d\" idx=\"%d\" value=\"%d\" />"), DISPLAY_DIMMED_AMBILIGHT_COLORS, i, get_num8_array(DISPLAY_DIMMED_AMBILIGHT_COLORS, i));
        http_send(buff);
    }

    // display modes
    for (ui = 0; ui < display_modes_count; ui++)
    {
        sprintf(buff, FS("<dispmode idx=\"%d\" name=\"%s\" />"), ui, sanitize_xml_string(tbl_modes[ui].description).c_str());
        http_send(buff);
    }

    // display animations
    for (i = 0; i < max_display_animation_variables; i++)
    {
        sprintf(buff, FS("<dispanim idx=\"%d\" name=\"%s\" dcl=\"%d\" def_dcl=\"%d\" flags=\"%d\"/>"),
            i,
            sanitize_xml_string(displayanimationvars[i].name).c_str(),
            displayanimationvars[i].deceleration,
            displayanimationvars[i].default_deceleration,
            displayanimationvars[i].flags);
        http_send(buff);
    }

    // color animations
    for (i = 0; i < MAX_COLOR_ANIMATION_VARIABLES; i++)
    {
        sprintf(buff, FS("<coloranim idx=\"%d\" name=\"%s\" dcl=\"%d\" def_dcl=\"%d\" flags=\"%d\"/>"),
            i,
            sanitize_xml_string(coloranimationvars[i].name).c_str(),
            coloranimationvars[i].deceleration,
            coloranimationvars[i].default_deceleration,
            coloranimationvars[i].flags);
        http_send(buff);
    }

    // ambilight modes
    for (i = 0; i < MAX_AMBILIGHT_MODE_VARIABLES; i++)
    {
        sprintf(buff, FS("<almode idx=\"%d\" name=\"%s\" dcl=\"%d\" def_dcl=\"%d\" flags=\"%d\"/>"),
            i,
            sanitize_xml_string(ambilightmodevars[i].name).c_str(),
            ambilightmodevars[i].deceleration,
            ambilightmodevars[i].default_deceleration,
            ambilightmodevars[i].flags);
        http_send(buff);
    }

    // night times
    for (i = 0; i < MAX_NIGHT_TIME_VARIABLES; i++)
    {
        sprintf(buff, FS("<nighttime idx=\"%d\" minutes=\"%d\" flags=\"%d\"/>"), i, nighttimevars[i].minutes, nighttimevars[i].flags);
        http_send(buff);
    }

    // ambilight night times
    for (i = 0; i < MAX_NIGHT_TIME_VARIABLES; i++)
    {
        sprintf(buff, FS("<ambinighttime idx=\"%d\" minutes=\"%d\" flags=\"%d\"/>"), i, ambilightnighttimevars[i].minutes, ambilightnighttimevars[i].flags);
        http_send(buff);
    }

    // alarm times
    for (i = 0; i < MAX_ALARM_TIME_VARIABLES; i++)
    {
        sprintf(buff, FS("<alarmtime idx=\"%d\" minutes=\"%d\" flags=\"%d\"/>"), i, alarmtimevars[i].minutes, alarmtimevars[i].flags);
        http_send(buff);
    }

    // overlays
    for (i = 0; i < MAX_OVERLAYS; i++)
    {
        sprintf(buff, FS("<overlay idx=\"%d\" type=\"%d\" interval=\"%d\" duration=\"%d\" date_code=\"%d\" date_start=\"%d\" days=\"%d\" flags=\"%d\" text=\"%s\"/>"),
            i,
            overlays[i].type,
            overlays[i].interval,
            overlays[i].duration,
            overlays[i].date_code,
            overlays[i].date_start,
            overlays[i].days,
            overlays[i].flags,
            sanitize_xml_string(overlays[i].text).c_str());
        http_send(buff);
    }

    http_send(FS("</settings>"));
    http_flush();

    return 0;
}

static int
http_get_display_power ()
{
    http_send(FS("HTTP/1.0 200 OK\r\nContent-Type: text/plain\r\n\r\n"));
    http_send(get_numvar (DISPLAY_POWER_NUM_VAR) ? "on\n" : "off\n");
    http_flush();

    return 0;
}

static int
http_get_ambilight_power ()
{
    http_send(FS("HTTP/1.0 200 OK\r\nContent-Type: text/plain\r\n\r\n"));
    http_send(get_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR) ? "on\n" : "off\n");
    http_flush();

    return 0;
}

static int
http_api_display_power_set ()
{
    char * value = http_get_param ("value");

    if (value && ! strcmp (value, "on"))
    {
        set_numvar (DISPLAY_POWER_NUM_VAR, 1);
    }
    else if (value && ! strcmp (value, "off"))
    {
        set_numvar (DISPLAY_POWER_NUM_VAR, 0);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"display_power\":\""));
    http_send (get_numvar (DISPLAY_POWER_NUM_VAR) ? "on" : "off");
    http_send (FS("\"}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_power_set ()
{
    char * value = http_get_param ("value");

    if (value && ! strcmp (value, "on"))
    {
        set_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR, 1);
    }
    else if (value && ! strcmp (value, "off"))
    {
        set_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR, 0);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_power\":\""));
    http_send (get_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR) ? "on" : "off");
    http_send (FS("\"}"));
    http_flush ();

    return 0;
}

static int
http_api_display_brightness_set ()
{
    char * value = http_get_param ("value");
    int    brightness = atoi (value ? value : "0");

    if (brightness < 0)
    {
        brightness = 0;
    }
    else if (brightness > 15)
    {
        brightness = 15;
    }

    set_numvar (DISPLAY_BRIGHTNESS_NUM_VAR, brightness);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"display_brightness\":"));
    char buf[8];
    sprintf (buf, "%d", brightness);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

