granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_auto_brightness_set ()
{
    char * value = http_get_param ("value");

    if (value && ! strcmp (value, "on"))
    {
        set_numvar (DISPLAY_AUTOMATIC_BRIGHTNESS_ACTIVE_NUM_VAR, 1);
    }
    else if (value && ! strcmp (value, "off"))
    {
        set_numvar (DISPLAY_AUTOMATIC_BRIGHTNESS_ACTIVE_NUM_VAR, 0);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"auto_brightness\":\""));
    http_send (get_numvar (DISPLAY_AUTOMATIC_BRIGHTNESS_ACTIVE_NUM_VAR) ? "on" : "off");
    http_send (FS("\"}"));
    http_flush ();

    return 0;
}

static int
http_api_display_mode_set ()
{
    char * value = http_get_param ("value");
    int    mode = atoi (value ? value : "0");

    if (mode < 0)
    {
        mode = 0;
    }
    else if (mode >= display_modes_count)
    {
        mode = display_modes_count ? display_modes_count - 1 : 0;
    }

    set_numvar (DISPLAY_MODE_NUM_VAR, mode);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"display_mode\":"));
    char buf[8];
    sprintf (buf, "%d", mode);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_display_it_is_set ()
{
    uint_fast8_t flags = get_numvar (DISPLAY_FLAGS_NUM_VAR);

    if (http_get_on_off_value ("value", flags & DISPLAY_FLAGS_PERMANENT_IT_IS))
    {
        flags |= DISPLAY_FLAGS_PERMANENT_IT_IS;
    }
    else
    {
        flags &= ~DISPLAY_FLAGS_PERMANENT_IT_IS;
    }

    set_numvar (DISPLAY_FLAGS_NUM_VAR, flags);
    http_json_ok ();

    return 0;
}

static int
http_api_ticker_set ()
{
    char * value = http_get_param ("value");

    set_strvar (TICKER_TEXT_STR_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_date_ticker_format_set ()
{
    char * value = http_get_param ("value");

    set_strvar (DATE_TICKER_FORMAT_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ticker_deceleration_set ()
{
    char * value = http_get_param ("value");
    int    deceleration = atoi (value ? value : "0");

    if (deceleration < 0)
    {
        deceleration = 0;
    }
    else if (deceleration > 255)
    {
        deceleration = 255;
    }

    set_numvar (TICKER_DECELRATION_NUM_VAR, deceleration);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ticker_deceleration\":"));
    char buf[8];
    sprintf (buf, "%d", deceleration);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_test_display ()
{
    rpc (TEST_DISPLAY_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_weather_appid_set ()
{
    char * value = http_get_param ("value");

    set_strvar (WEATHER_APPID_STR_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_weather_city_set ()
{
    char * value = http_get_param ("value");

    set_strvar (WEATHER_CITY_STR_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_weather_coordinates_set ()
{
    char * lon = http_get_param ("lon");
    char * lat = http_get_param ("lat");

    if (! lon)
    {
        lon = (char *) "";
    }

    if (! lat)
    {
        lat = (char *) "";
    }

    strsubst (lon, ',', '.');
    strsubst (lat, ',', '.');

    set_strvar (WEATHER_LON_STR_VAR, lon);
    set_strvar (WEATHER_LAT_STR_VAR, lat);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_weather_get_now ()
{
    rpc (GET_WEATHER_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_weather_get_forecast ()
{
    rpc (GET_WEATHER_FC_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_scan ()
{
    int networks;
    int idx;

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ssid\":\""));
    http_send (sanitize_xml_string(wifi_ssid).c_str());
    http_send (FS("\",\"ip\":\""));
    http_send (sanitize_xml_string(wifi_ip_address).c_str());
    http_send (FS("\",\"mode\":\""));
    http_send (wifi_ap_mode ? "ap" : "client");
    http_send (FS("\",\"networks\":["));

    networks = WiFi.scanNetworks();

    for (idx = 0; idx < networks; idx++)
    {
        if (idx)
        {
            http_send (FS(","));
        }

        http_send (FS("\""));
        http_send (sanitize_xml_string(WiFi.SSID(idx)).c_str());
        http_send (FS("\""));
    }

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static int
http_api_network_client_set ()
{
    char * ssid = http_get_param ("ssid");
    char * key  = http_get_param ("key");

    if (! ssid)
    {
        ssid = (char *) "";
    }

    if (! key)
    {
        key = (char *) "";
    }

    wifi_connect (ssid, key, true);

    String pssid = ssid;
    String pkey = key;

    if (! pssid.equals (eeprom_ssid))
    {
        pssid.toCharArray (eeprom_ssid, EEPROM_SSID_LEN);
        eeprom_save_ssid ();
    }

    if (! pkey.equals (eeprom_ssidkey))
    {
        pkey.toCharArray (eeprom_ssidkey, EEPROM_SSID_KEY_LEN);
        eeprom_save_ssidkey ();
    }

    eeprom_flags &= ~EEPROM_FLAG_BOOT_AS_AP;
    eeprom_save_flags ();
    eeprom_commit ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

