granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_network_ap_set ()
{
    char * ssid = http_get_param ("ssid");
    char * key  = http_get_param ("key");

    if (! ssid)
    {
        ssid = (char *) "";
    }

    if (! key)
    {
        key = (char *) "";
    }

    if (strlen (key) >= 10)
    {
        String ap_ssid = ssid;
        String ap_key  = key;

        if (! ap_ssid.equals (eeprom_ap_ssid))
        {
            ap_ssid.toCharArray (eeprom_ap_ssid, EEPROM_AP_SSID_LEN);
            eeprom_save_ap_ssid ();
        }

        if (! ap_key.equals (eeprom_ap_ssidkey))
        {
            ap_key.toCharArray (eeprom_ap_ssidkey, EEPROM_AP_SSID_KEY_LEN);
            eeprom_save_ap_ssidkey ();
        }

        eeprom_flags |= EEPROM_FLAG_BOOT_AS_AP;
        eeprom_save_flags ();
        eeprom_commit ();

        wifi_ap (ssid, key);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_eeprom_settings ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ssid\":\""));
    http_send (sanitize_json_string (eeprom_ssid).c_str ());
    http_send (FS("\",\"key\":\""));
    http_send (sanitize_json_string (eeprom_ssidkey).c_str ());
    http_send (FS("\",\"ap_ssid\":\""));
    http_send (sanitize_json_string (eeprom_ap_ssid).c_str ());
    http_send (FS("\",\"ap_key\":\""));
    http_send (sanitize_json_string (eeprom_ap_ssidkey).c_str ());
    http_send (FS("\",\"flags\":"));
    http_send (eeprom_flags ? "1" : "0");
    http_send (FS(",\"boot_as_ap\":"));
    http_send ((eeprom_flags & EEPROM_FLAG_BOOT_AS_AP) ? "true" : "false");
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_eeprom_settings_set ()
{
    char * ssid = http_get_param ("ssid");
    char * key = http_get_param ("key");
    char * ap_ssid = http_get_param ("ap_ssid");
    char * ap_key = http_get_param ("ap_key");
    char * boot_as_ap = http_get_param ("boot_as_ap");

    if (! ssid)     { ssid = (char *) ""; }
    if (! key)      { key = (char *) ""; }
    if (! ap_ssid)  { ap_ssid = (char *) ""; }
    if (! ap_key)   { ap_key = (char *) ""; }

    String pssid = ssid;
    String pkey = key;
    String pap_ssid = ap_ssid;
    String pap_key = ap_key;

    if (! pssid.equals (eeprom_ssid))
    {
        pssid.toCharArray (eeprom_ssid, EEPROM_SSID_LEN);
        eeprom_save_ssid ();
    }

    if (! pkey.equals (eeprom_ssidkey))
    {
        pkey.toCharArray (eeprom_ssidkey, EEPROM_SSID_KEY_LEN);
        eeprom_save_ssidkey ();
    }

    if (! pap_ssid.equals (eeprom_ap_ssid))
    {
        pap_ssid.toCharArray (eeprom_ap_ssid, EEPROM_AP_SSID_LEN);
        eeprom_save_ap_ssid ();
    }

    if (! pap_key.equals (eeprom_ap_ssidkey))
    {
        pap_key.toCharArray (eeprom_ap_ssidkey, EEPROM_AP_SSID_KEY_LEN);
        eeprom_save_ap_ssidkey ();
    }

    if (boot_as_ap && ! strcmp (boot_as_ap, "on"))
    {
        eeprom_flags |= EEPROM_FLAG_BOOT_AS_AP;
    }
    else
    {
        eeprom_flags &= ~EEPROM_FLAG_BOOT_AS_AP;
    }

    eeprom_save_flags ();
    eeprom_commit ();

    http_json_ok ();

    return 0;
}

static int
http_api_network_timeserver_set ()
{
    char * value = http_get_param ("value");

    set_strvar (TIMESERVER_STR_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_timezone_set ()
{
    char * value = http_get_param ("value");
    int tz = atoi (value ? value : "0");
    uint_fast16_t utz = 0;

    if (tz < 0)
    {
        utz = -tz;
        utz |= 0x100;
    }
    else
    {
        utz = tz;
    }

    if (get_numvar (TIMEZONE_NUM_VAR) & 0x200)
    {
        utz |= 0x200;
    }

    set_numvar (TIMEZONE_NUM_VAR, utz);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_summertime_set ()
{
    char * value = http_get_param ("value");
    uint_fast16_t utz = get_numvar (TIMEZONE_NUM_VAR);

    if (value && ! strcmp (value, "on"))
    {
        utz |= 0x200;
    }
    else
    {
        utz &= ~0x200;
    }

    set_numvar (TIMEZONE_NUM_VAR, utz);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_get_time ()
{
    rpc (GET_NET_TIME_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_wps ()
{
    wifi_wps ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_update_host_set ()
{
    char * value = http_get_param ("value");

    set_strvar (UPDATE_HOST_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_update_path_set ()
{
    char * value = http_get_param ("value");

    set_strvar (UPDATE_PATH_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_update_download_assets ()
{
    const char * fname_icon = (const char *) 0;
    const char * fname_weather = (const char *) 0;
    int download_rtc = 2;
    STR_VAR * sv;
    char * update_host;
    char * update_path;

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon = "wc24h-icon.txt";
                fname_weather = "wc24h-weather.txt";
                break;
            case HW_WC_12H:
                fname_icon = "wc12h-icon.txt";
                fname_weather = "wc12h-weather.txt";
                break;
            case HW_UCLOCK:
                fname_icon = "uc-icon.txt";
                fname_weather = "uc-weather.txt";
                break;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;
    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    LittleFS.begin ();

    if (fname_icon)
    {
        download_rtc = download_file (update_host, update_path, fname_icon);
    }

