granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (fname_weather)
    {
        download_rtc = download_file (update_host, update_path, fname_weather);
    }

    LittleFS.end ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (download_rtc == 1 ? "true" : "false");
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_update_download_app_bundle ()
{
    int download_rtc = 2;
    int app_bundle_rtc = -1;
    STR_VAR * sv;
    char * update_host;
    char * update_path;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;
    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    LittleFS.begin ();
    download_rtc = download_file (update_host, update_path, APP_BUNDLE_FILENAME);
    LittleFS.end ();

    if (download_rtc == 1)
    {
        app_bundle_rtc = install_app_bundle (APP_BUNDLE_FILENAME);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send ((download_rtc == 1 && app_bundle_rtc == 1) ? "true" : "false");
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_maintenance_format_fs ()
{
    LittleFS.begin ();
    LittleFS.format ();
    LittleFS.end ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_maintenance_reset_stm32 ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();
    delay (200);
    stm32_reset ();

    return 0;
}

static int
http_api_maintenance_reset_eeprom ()
{
    rpc (RESET_EEPROM_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_datetime_set ()
{
    TM  tm;
    int year = atoi (http_get_param ("year"));
    int month = atoi (http_get_param ("month"));
    int day = atoi (http_get_param ("day"));
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (year < 2000)
    {
        year = 2000;
    }
    else if (year > 2999)
    {
        year = 2999;
    }

    if (month < 1)
    {
        month = 1;
    }
    else if (month > 12)
    {
        month = 12;
    }

    if (day < 1)
    {
        day = 1;
    }
    else if (day > 31)
    {
        day = 31;
    }

    if (hour < 0)
    {
        hour = 0;
    }
    else if (hour > 23)
    {
        hour = 23;
    }

    if (minute < 0)
    {
        minute = 0;
    }
    else if (minute > 59)
    {
        minute = 59;
    }

    tm.tm_year = year - 1900;
    tm.tm_mon = month - 1;
    tm.tm_mday = day;
    tm.tm_hour = hour;
    tm.tm_min = minute;
    tm.tm_sec = 0;
    tm.tm_wday = dayofweek (day, month, year);

    set_tm_var (CURRENT_TM_VAR, &tm);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_learn_ir ()
{
    rpc (LEARN_IR_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_display ()
{
    rpc (DISPLAY_TEMPERATURE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_rtc_correction_set ()
{
    uint_fast8_t temp_index = get_numvar (RTC_TEMP_INDEX_NUM_VAR);
    uint_fast8_t old_correction = get_numvar (RTC_TEMP_CORRECTION_NUM_VAR);
    int temp_corr = atoi (http_get_param ("value"));

    if (temp_corr < 0)
    {
        temp_corr = -temp_corr;
    }

    if (old_correction > temp_corr)
    {
        temp_index += (old_correction - temp_corr);
    }
    else
    {
        temp_index -= (temp_corr - old_correction);
    }

    set_numvar (RTC_TEMP_INDEX_NUM_VAR, temp_index);
    set_numvar (RTC_TEMP_CORRECTION_NUM_VAR, temp_corr);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_ds18xx_correction_set ()
{
    uint_fast8_t temp_index = get_numvar (DS18XX_TEMP_INDEX_NUM_VAR);
    uint_fast8_t old_correction = get_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR);
    int temp_corr = atoi (http_get_param ("value"));

    if (temp_corr < 0)
    {
        temp_corr = -temp_corr;
    }

    if (old_correction > temp_corr)
    {
        temp_index += (old_correction - temp_corr);
    }
    else
    {
        temp_index -= (temp_corr - old_correction);
    }

    set_numvar (DS18XX_TEMP_INDEX_NUM_VAR, temp_index);
    set_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR, temp_corr);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_min_set ()
{
    rpc (LDR_MIN_VALUE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_min_value_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }

    set_numvar (LDR_MIN_VALUE_NUM_VAR, value);
    http_json_ok ();

    return 0;
}

static int
http_api_ldr_max_set ()
{
    rpc (LDR_MAX_VALUE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

