granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_ambilight_online_set ()
{
    char * value = http_get_param ("value");

    if (value && ! strcmp (value, "on"))
    {
        set_numvar (AMBILIGHT_IS_UP_NUM_VAR, 1);
    }
    else if (value && ! strcmp (value, "off"))
    {
        set_numvar (AMBILIGHT_IS_UP_NUM_VAR, 0);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_online\":\""));
    http_send (get_numvar (AMBILIGHT_IS_UP_NUM_VAR) ? "on" : "off");
    http_send (FS("\"}"));
    http_flush ();

    return 0;
}

static int
http_api_dfplayer_volume_set ()
{
    char * value = http_get_param ("value");
    int    volume = atoi (value ? value : "0");

    if (volume < 0)
    {
        volume = 0;
    }
    else if (volume > DFPLAYER_MAX_VOLUME)
    {
        volume = DFPLAYER_MAX_VOLUME;
    }

    set_numvar (DFPLAYER_VOLUME_NUM_VAR, volume);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"dfplayer_volume\":"));
    char buf[8];
    sprintf (buf, "%d", volume);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_dfplayer_mode_set ()
{
    char * value = http_get_param ("value");
    int    mode = atoi (value ? value : "0");

    if (mode < DFPLAYER_MODE_NONE)
    {
        mode = DFPLAYER_MODE_NONE;
    }
    else if (mode > DFPLAYER_MODE_SPEAK)
    {
        mode = DFPLAYER_MODE_SPEAK;
    }

    set_numvar (DFPLAYER_MODE_NUM_VAR, mode);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_bell_flags_set ()
{
    uint_fast8_t flags = DFPLAYER_MODE_BELL_FLAG_NONE;

    if (http_get_on_off_value ("m15", 0))
    {
        flags |= DFPLAYER_MODE_BELL_FLAG_15;
    }
    if (http_get_on_off_value ("m30", 0))
    {
        flags |= DFPLAYER_MODE_BELL_FLAG_30;
    }
    if (http_get_on_off_value ("m45", 0))
    {
        flags |= DFPLAYER_MODE_BELL_FLAG_45;
    }

    set_numvar (DFPLAYER_BELL_FLAGS_NUM_VAR, flags);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_speak_cycle_set ()
{
    char * value = http_get_param ("value");
    int    speak_cycle = atoi (value ? value : "0");

    if (speak_cycle < 0)
    {
        speak_cycle = 0;
    }
    else if (speak_cycle > 255)
    {
        speak_cycle = 255;
    }

    set_numvar (DFPLAYER_SPEAK_CYCLE_NUM_VAR, speak_cycle);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_silence_start_set ()
{
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (hour >= 0 && hour < 24 && minute >= 0 && minute < 60)
    {
        set_numvar (DFPLAYER_SILENCE_START_NUM_VAR, hour * 60 + minute);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_silence_stop_set ()
{
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (hour >= 0 && hour < 24 && minute >= 0 && minute < 60)
    {
        set_numvar (DFPLAYER_SILENCE_STOP_NUM_VAR, hour * 60 + minute);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_play ()
{
    int folder = atoi (http_get_param ("folder"));
    int track = atoi (http_get_param ("track"));

    if (folder < 0)
    {
        folder = 0;
    }
    else if (folder > 255)
    {
        folder = 255;
    }

    if (track < 0)
    {
        track = 0;
    }
    else if (track > 255)
    {
        track = 255;
    }

    set_numvar (DFPLAYER_PLAY_FOLDER_TRACK_NUM_VAR, folder << 8 | track);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_alarm_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_ALARM_TIME_VARIABLES)
    {
        ALARM_TIME *    at;
        uint_fast8_t    from_day;
        uint_fast8_t    to_day;
        uint_fast16_t   minutes;
        uint_fast8_t    flags;

        at = get_alarm_time_var ((ALARM_TIME_VARIABLE) idx);
        flags = at ? at->flags : 0;

        if (http_get_on_off_value ("active", 0))
        {
            flags |= ALARM_TIME_FLAG_ACTIVE;
        }
        else
        {
            flags &= ~ALARM_TIME_FLAG_ACTIVE;
        }

        from_day = atoi (http_get_param ("from"));
        to_day = atoi (http_get_param ("to"));

        flags &= ~(ALARM_TIME_FROM_DAY_MASK | ALARM_TIME_TO_DAY_MASK);
        flags |= ALARM_TIME_FROM_DAY_MASK & (from_day << 3);
        flags |= ALARM_TIME_TO_DAY_MASK & to_day;

        minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));
        set_alarm_time_var ((ALARM_TIME_VARIABLE) idx, minutes, flags);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);

    if (idx >= 0 && idx < MAX_OVERLAYS)
    {
        if (idx == n_overlays && n_overlays < MAX_OVERLAYS)
        {
            n_overlays++;
            set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays);
        }

        if (idx < n_overlays)
        {
            uint_fast8_t val;
            uint_fast8_t valmm;
            uint_fast8_t valdd;
            char * text;

            if (http_get_on_off_value ("active", 0))
            {
                overlays[idx].flags |= OVERLAY_FLAG_ACTIVE;
            }
            else
            {
                overlays[idx].flags &= ~OVERLAY_FLAG_ACTIVE;
            }

            overlays[idx].type = atoi (http_get_param ("type"));
            val = atoi (http_get_param ("interval"));

            if (val == 0)
            {
                val = 5;
            }

            overlays[idx].interval = val;

            val = atoi (http_get_param ("duration"));

            if (val < 5)
            {
                val = 5;
            }
            else if (val > 9)
            {
                val = 9;
            }

            overlays[idx].duration = val;
            overlays[idx].date_code = atoi (http_get_param ("date_code"));

            valmm = atoi (http_get_param ("month"));
            valdd = atoi (http_get_param ("day"));

            if (valmm < 1 || valmm > 12 || valdd < 1 || valdd > 31)
            {
                overlays[idx].date_start = 0;
            }
            else
            {
                overlays[idx].date_start  = (valmm << 8) | valdd;
            }

            val = atoi (http_get_param ("days"));

            if (val < 1)
            {
                val = 1;
            }

            overlays[idx].days = val;

            text = http_get_param ("value");

            if (text)
            {
                strncpy (overlays[idx].text, text, OVERLAY_MAX_TEXT_LEN);
                overlays[idx].text[OVERLAY_MAX_TEXT_LEN] = '\0';
            }

            set_overlay_var (idx);
        }
    }

    http_json_ok ();

