granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_overlay_display ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR))
    {
        set_numvar (DISPLAY_OVERLAY_NUM_VAR, idx);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_delete ()
{
    int idx = atoi (http_get_param ("idx"));
    int n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);
    int i;

    if (idx >= 0 && idx < n_overlays)
    {
        for (i = idx; i < n_overlays - 1; i++)
        {
            overlays[i] = overlays[i + 1];
            set_overlay_var (i);
        }

        if (n_overlays > 0)
        {
            memset (&overlays[n_overlays - 1], 0, sizeof (OVERLAY));
            set_overlay_var (n_overlays - 1);
            set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays - 1);
        }
    }

    http_json_ok ();

    return 0;
}

static int
http_api_timer_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_NIGHT_TIME_VARIABLES)
    {
        uint_fast8_t flags = 0;
        uint_fast8_t from_day = atoi (http_get_param ("from"));
        uint_fast8_t to_day = atoi (http_get_param ("to"));
        uint_fast16_t minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));

        if (http_get_on_off_value ("active", 0))
        {
            flags |= NIGHT_TIME_FLAG_ACTIVE;
        }

        if (http_get_on_off_value ("switch_on", 0))
        {
            flags |= NIGHT_TIME_FLAG_SWITCH_ON;
        }

        flags |= NIGHT_TIME_FROM_DAY_MASK & (from_day << 3);
        flags |= NIGHT_TIME_TO_DAY_MASK & to_day;

        set_night_time_var (0, (NIGHT_TIME_VARIABLE) idx, minutes, flags);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_ambilight_timer_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_NIGHT_TIME_VARIABLES)
    {
        uint_fast8_t flags = 0;
        uint_fast8_t from_day = atoi (http_get_param ("from"));
        uint_fast8_t to_day = atoi (http_get_param ("to"));
        uint_fast16_t minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));

        if (http_get_on_off_value ("active", 0))
        {
            flags |= NIGHT_TIME_FLAG_ACTIVE;
        }

        if (http_get_on_off_value ("switch_on", 0))
        {
            flags |= NIGHT_TIME_FLAG_SWITCH_ON;
        }

        flags |= NIGHT_TIME_FROM_DAY_MASK & (from_day << 3);
        flags |= NIGHT_TIME_TO_DAY_MASK & to_day;

        set_night_time_var (1, (NIGHT_TIME_VARIABLE) idx, minutes, flags);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_icons ()
{
    const char *  fname = (const char *) 0;

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("["));

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H: fname = "wc24h-icon.txt";  break;
            case HW_WC_12H: fname = "wc12h-icon.txt";  break;
            case HW_UCLOCK: fname = "uc-icon.txt";     break;
        }
    }

    LittleFS.begin ();

    if (fname)
    {
        File fp = LittleFS.open (fname, "r");

        if (fp)
        {
            int   ch = fp.read ();
            int   first = 1;
            char  icon_name[32 + 1];

            while (ch == '*')
            {
                int i = 0;

                while ((ch = fp.read ()) != EOF)
                {
                    if (ch == '\r' || ch == '\n')
                    {
                        break;
                    }

                    if (i < 32)
                    {
                        icon_name[i++] = ch;
                    }
                }

                icon_name[i] = '\0';
                trim (icon_name);

                if (! first)
                {
                    http_send (FS(","));
                }

                http_send (FS("\""));
                http_send (sanitize_xml_string(icon_name).c_str());
                http_send (FS("\""));
                first = 0;

                while ((ch = fp.read()) != '*' && ch >= 0)
                {
                    ;
                }
            }

            fp.close ();
        }
    }

    LittleFS.end ();

    http_send (FS("]"));
    http_flush ();

    return 0;
}

static int
http_api_fs_info ()
{
    FSInfo fsinfo;

    LittleFS.begin ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));

    if (LittleFS.info (fsinfo))
    {
        char buf[16];

        http_send (FS("{\"ok\":true"));

        sprintf (buf, "%d", fsinfo.totalBytes);
        http_send (FS(",\"total\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.usedBytes);
        http_send (FS(",\"used\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.blockSize);
        http_send (FS(",\"block_size\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.pageSize);
        http_send (FS(",\"page_size\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.maxOpenFiles);
        http_send (FS(",\"max_open_files\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.maxPathLength);
        http_send (FS(",\"max_path_length\":"));
        http_send (buf);

        http_send (FS("}"));
    }
    else
    {
        http_send (FS("{\"ok\":false}"));
    }

    LittleFS.end ();
    http_flush ();

    return 0;
}

static int
http_api_fs_list ()
{
    Dir dir;
    int first = 1;

    LittleFS.begin ();
    dir = LittleFS.openDir ("");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"files\":["));

    while (dir.next ())
    {
        File f = dir.openFile ("r");
        char sizebuf[16];

        if (! first)
        {
            http_send (FS(","));
        }

        sprintf (sizebuf, "%d", f ? f.size () : 0);
        http_send (FS("{\"name\":\""));
        http_send (sanitize_json_string (dir.fileName ()).c_str ());
        http_send (FS("\",\"size\":"));
        http_send (sizebuf);
        http_send (FS("}"));

        if (f)
        {
            f.close ();
        }

        first = 0;
    }

