granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    LittleFS.end ();

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static int
http_api_fs_show ()
{
    char * fname = http_get_param ("filename");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: text/plain; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));

    if (fname && *fname)
    {
        LittleFS.begin ();
        File fp = LittleFS.open (fname, "r");

        if (fp)
        {
            while (fp.available ())
            {
                char b[64];
                int n = fp.readBytes (b, sizeof (b));

                if (n > 0)
                {
                    for (int i = 0; i < n; i++)
                    {
                        char cbuf[2];
                        cbuf[0] = b[i];
                        cbuf[1] = '\0';
                        http_send (cbuf);
                    }
                }
            }

            fp.close ();
        }

        LittleFS.end ();
    }

    http_flush ();

    return 0;
}

static int
http_api_fs_remove ()
{
    char * fname = http_get_param ("filename");

    if (fname && *fname)
    {
        LittleFS.begin ();
        LittleFS.remove (fname);
        LittleFS.end ();
    }

    http_json_ok ();

    return 0;
}

static int
http_api_update_status ()
{
    STR_VAR * sv;
    char * update_host;
    char * update_path;
    uint32_t flashsize;
    char new_esp_version[16];
    char new_wc_version[16];
    char stm32_default_filename[MAX_UPDATE_FILENAME_LEN];
    const char * filter = (const char *) NULL;
    String release_notes;
    uint_fast8_t assets_available = 0;
    uint_fast8_t app_bundle_available = 0;
    const char * fname_icon = (const char *) 0;
    const char * fname_weather = (const char *) 0;
    int len;
    int first = 1;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        set_strvar (UPDATE_HOST_VAR, DEFAULT_UPDATE_HOST);
        sv = get_strvar (UPDATE_HOST_VAR);
        update_host = sv->str;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        set_strvar (UPDATE_PATH_VAR, DEFAULT_UPDATE_PATH);
        sv = get_strvar (UPDATE_PATH_VAR);
        update_path = sv->str;
    }

    flashsize = ESP.getFlashChipRealSize ();
    http_fetch_remote_line (update_host, update_path, ESP_WORDCLOCK_TXT, new_esp_version, sizeof (new_esp_version));
    http_fetch_remote_line (update_host, update_path, WC_TXT, new_wc_version, sizeof (new_wc_version));
    release_notes = http_fetch_remote_text (update_host, update_path, RELEASENOTE_HTML, 3072);
    http_build_stm32_default_filename (stm32_default_filename, sizeof (stm32_default_filename), &filter);

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon = "wc24h-icon.txt";
                fname_weather = "wc24h-weather.txt";
                break;
            case HW_WC_12H:
                fname_icon = "wc12h-icon.txt";
                fname_weather = "wc12h-weather.txt";
                break;
            case HW_UCLOCK:
                fname_icon = "uc-icon.txt";
                fname_weather = "uc-weather.txt";
                break;
        }
    }

    if (fname_icon && fname_weather)
    {
        int len_icon = httpclient (update_host, update_path, fname_icon);

        if (len_icon > 0)
        {
            httpclient_stop ();

            int len_weather = httpclient (update_host, update_path, fname_weather);

            if (len_weather > 0)
            {
                assets_available = 1;
                httpclient_stop ();
            }
        }
    }

    if (httpclient (update_host, update_path, APP_BUNDLE_FILENAME) > 0)
    {
        app_bundle_available = 1;
        httpclient_stop ();
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"flash_size\":"));

    char buf[16];
    sprintf (buf, "%d", flashsize);
    http_send (buf);

    http_send (FS(",\"can_update\":"));
    http_send (flashsize >= 4194304 ? "true" : "false");
    http_send (FS(",\"local_update_supported\":"));
    http_send (flashsize >= 1048576 ? "true" : "false");
    http_send (FS(",\"assets_available\":"));
    http_send (assets_available ? "true" : "false");
    http_send (FS(",\"app_bundle_available\":"));
    http_send (app_bundle_available ? "true" : "false");
    http_send (FS(",\"esp_version\":\""));
    http_send (sanitize_json_string (ESP_VERSION).c_str ());
    http_send (FS("\",\"esp_available\":\""));
    http_send (sanitize_json_string (new_esp_version).c_str ());
    http_send (FS("\",\"wc_version\":\""));
    http_send (sanitize_json_string (get_strvar (VERSION_STR_VAR)->str).c_str ());
    http_send (FS("\",\"wc_available\":\""));
    http_send (sanitize_json_string (new_wc_version).c_str ());
    http_send (FS("\",\"release_notes\":\""));
    http_send (sanitize_json_string (release_notes).c_str ());
    http_send (FS("\",\"stm32_default\":\""));
    http_send (sanitize_json_string (stm32_default_filename).c_str ());
    http_send (FS("\",\"stm32_files\":["));

    len = httpclient (update_host, update_path, WC_LIST_TXT);

    if (len > 0)
    {
        char fname[MAX_UPDATE_FILENAME_LEN];
        int ch;
        int l = 0;

        while (len > 0)
        {
            ch = httpclient_read (&len);

            if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
            {
                fname[l++] = ch;
            }
            else if (ch == '\n')
            {
                int show_option = 1;

                fname[l] = '\0';
                l = 0;

                if (filter)
                {
                    int fname_len = strlen (fname);

                    if (fname_len < 6 || strncmp (fname + 6, filter, strlen (filter)) != 0)
                    {
                        show_option = 0;
                    }
                }

