granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
                if (show_option)
                {
                    if (! first)
                    {
                        http_send (FS(","));
                    }

                    http_send (FS("\""));
                    http_send (sanitize_json_string (fname).c_str ());
                    http_send (FS("\""));
                    first = 0;
                }
            }
        }

        httpclient_stop ();
    }

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static int
http_api_update_table_files ()
{
    STR_VAR * sv;
    char * update_host;
    char * update_path;
    const char * tables_filter = (const char *) NULL;
    char * current_tables = tables_fname ();
    int len;
    int first = 1;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        set_strvar (UPDATE_HOST_VAR, DEFAULT_UPDATE_HOST);
        sv = get_strvar (UPDATE_HOST_VAR);
        update_host = sv->str;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        set_strvar (UPDATE_PATH_VAR, DEFAULT_UPDATE_PATH);
        sv = get_strvar (UPDATE_PATH_VAR);
        update_path = sv->str;
    }

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H: tables_filter = "wc24h-tables-"; break;
            case HW_WC_12H: tables_filter = "wc12h-tables-"; break;
            default:        tables_filter = (const char *) NULL; break;
        }
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"current_table\":\""));
    http_send (sanitize_json_string (current_tables ? current_tables : "").c_str ());
    http_send (FS("\",\"table_files\":["));

    if (tables_filter)
    {
        len = httpclient (update_host, update_path, WC_TABLES_LIST_TXT);

        if (len > 0)
        {
            char fname[MAX_UPDATE_FILENAME_LEN];
            int ch;
            int l = 0;

            while (len > 0)
            {
                ch = httpclient_read (&len);

                if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
                {
                    fname[l++] = ch;
                }
                else if (ch == '\n')
                {
                    fname[l] = '\0';
                    l = 0;

                    if (fname[0] && ! strncmp (fname, tables_filter, strlen (tables_filter)))
                    {
                        if (! first)
                        {
                            http_send (FS(","));
                        }

                        http_send (FS("\""));
                        http_send (sanitize_json_string (fname).c_str ());
                        http_send (FS("\""));
                        first = 0;
                    }
                }
            }

            httpclient_stop ();
        }
    }

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static void
reset_button (void)
{
    http_send_FS ("<form method=\"GET\" action=\"/flash_stm32_local\" style=\"display:inline\">"
                  "<button type=\"submit\" name=\"action\" value=\"reset\">Reset STM32</button>"
                  "</form>\r\n");

}

static uint_fast8_t
run_local_stm32_flash_response ()
{
    http_header("Local Update", NULL, NULL);
    begin_box ("Local Update");

    for (int i = 0; i < 100; i++)
    {
        http_send ("          ");
    }

    LittleFS.begin ();
    stm32_flash_from_local();
    LittleFS.remove ("stm32.hex");
    LittleFS.end ();
    http_send_FS ("Done. <font color=red>Please Reset your STM32 now!</font></B><BR>\r\n");
    reset_button ();
    end_box ();
    http_trailer ();
    http_flush ();
    return 0;
}

static uint_fast8_t
http_api_local_stm32_upload ()
{
    size_t      content_length = 0;
    uint32_t    flashsize = ESP.getFlashChipRealSize ();
    uint_fast8_t ok = 0;

    if (flashsize >= 1048576 && read_post_headers (&content_length) && content_length > 0)
    {
        LittleFS.begin ();

        File f = LittleFS.open ("stm32.hex", "w+");

        if (f)
        {
            ok = read_request_body_to_file (f, content_length) ? 1 : 0;
            f.close ();
        }

        LittleFS.end ();
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");
    http_send (FS("}"));
    http_flush ();
    return 0;
}

static uint_fast8_t
http_api_local_stm32_flash ()
{
    uint_fast8_t exists = 0;

    LittleFS.begin ();
    exists = LittleFS.exists ("stm32.hex") ? 1 : 0;
    LittleFS.end ();

    if (exists)
    {
        return run_local_stm32_flash_response ();
    }

    http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("Keine lokale STM32-Datei vorhanden.\r\n"));
    http_flush ();
    return 0;
}

static uint_fast8_t
http_api_local_esp_update ()
{
    size_t      content_length = 0;
    uint32_t    max_sketch_space = (ESP.getFreeSketchSpace () - 0x1000) & 0xFFFFF000;
    uint_fast8_t ok = 0;
    uint16_t    error_code = 0;
    size_t      bytes_written = 0;
    size_t      skipped = 0;
    size_t      first_chunk_len = 0;
    uint_fast8_t begin_ok = 0;
    uint_fast8_t stream_ok = 0;
    uint_fast8_t end_ok = 0;
    size_t      progress_before_end = 0;
    size_t      remaining_before_end = 0;
    uint8_t     first_chunk[8];

    if (read_post_headers (&content_length) && content_length > 0 && content_length < max_sketch_space)
    {
        Update.runAsync (true);
        skipped = skip_leading_body_newlines ();

        if (Update.begin (max_sketch_space, U_FLASH))
        {
            begin_ok = 1;

            while (first_chunk_len < sizeof (first_chunk) && first_chunk_len < content_length)
            {
                unsigned long start_millis = millis ();

                while (! http_client.available () && (millis () - start_millis) < READ_BODY_TIMEOUT)
                {
                    yield ();
                }

                if (! http_client.available ())
                {
                    break;
                }

