granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
                int ch = http_client.read ();

                if (ch < 0)
                {
                    break;
                }

                first_chunk[first_chunk_len++] = (uint8_t) ch;
            }

            if (first_chunk_len > 0)
            {
                bytes_written = Update.write (first_chunk, first_chunk_len);
            }

            if (bytes_written == first_chunk_len)
            {
                bytes_written += read_request_body_to_update (content_length - first_chunk_len);
            }

            stream_ok = bytes_written == content_length ? 1 : 0;
            progress_before_end = Update.progress ();
            remaining_before_end = Update.remaining ();

            if (stream_ok && Update.end (true))
            {
                end_ok = 1;
                ok = 1;
            }
            else
            {
                error_code = Update.getError ();
                Update.end ();
            }
        }
        else
        {
            error_code = Update.getError ();
        }
    }
    else if (content_length >= max_sketch_space)
    {
        error_code = 1001;
    }
    else
    {
        error_code = 1000;
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");
    http_send (FS(",\"error\":"));
    char errbuf[16];
    sprintf (errbuf, "%u", error_code);
    http_send (errbuf);
    http_send (FS(",\"detail\":\""));
    char chunkbuf[32];
    int chunkbuf_len = 0;
    for (size_t i = 0; i < first_chunk_len && chunkbuf_len < (int) sizeof (chunkbuf) - 3; i++)
    {
        chunkbuf_len += sprintf (chunkbuf + chunkbuf_len, "%02X", first_chunk[i]);
    }
    char detailbuf[192];
    sprintf (detailbuf, "len=%u max=%u skip=%u first=%s begin=%u written=%u progress=%u remaining=%u stream=%u end=%u", (unsigned) content_length, (unsigned) max_sketch_space, (unsigned) skipped, chunkbuf_len ? chunkbuf : "--", begin_ok, (unsigned) bytes_written, (unsigned) progress_before_end, (unsigned) remaining_before_end, stream_ok, end_ok);
    http_send (sanitize_json_string (detailbuf).c_str ());
    http_send (FS("\""));
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static uint_fast8_t
http_api_local_esp_restart ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();
    delay (500);
    ESP.restart ();
    return 0;
}

static uint_fast8_t
flash_stm32_local (bool post = false)
{
    char *              action;
    int                 do_reset = 0;
    uint32_t            flashsize;

    flashsize = ESP.getFlashChipRealSize ();

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "reset"))
        {
            do_reset = 1;
        }
    }

    if (flashsize >= 1048576)
    {
        if (post)
        {
            String line;

            // find the line with content type and boundary string
            String boundary;

            while (read_line(line))
            {
                if (line.startsWith("Content-Type:"))
                {
                    int n = line.indexOf("boundary=");
                    if (n > 0)
                    {
                        boundary = "--" + line.substring(n + strlen("boundary="));
                    }
                    break;
                }
            }

            // no boundary? something is wrong
            if (boundary == "")
            {
                http_header("Local Update", NULL, NULL);
                begin_box ("Local Update");
                http_send_FS ("<font color='red'>Wrong http header</font><br/>");
            }
            else
            {
                int i;

                // read until a boundary has been found
                while(read_line(line) && line != boundary)
                {
                    ;
                }

                // read the empty line
                while (read_line(line) && line != "")
                {
                    ;
                }

                LittleFS.begin();
                File f = LittleFS.open("stm32.hex", "w+");

                if (f)
                {
                    // read and save file content until the boundary has been found
                    while (read_line(line))
                    {
                        // boundary found, end of file
                        if (line == boundary)
                        {
                            break;
                        }
                        f.write((const unsigned char*)line.c_str(), line.length());
                        f.write('\n');
                    }
    
                    f.close();

                    return run_local_stm32_flash_response ();
                }
                else
                {
                    http_header("Local Update", NULL, NULL);
                    begin_box ("Local Update");
                    http_send_FS ("<font color='red'>cannot open stm32.hex on filesystem for writing.</font><br/>");
                }
    
                LittleFS.end();
            }
            end_box ();
            http_trailer ();
            http_flush ();
            return 0;
        }
        else if (do_reset)
        {
            http_header ("Local Update", "20", "/");
            http_send ("<P><B>Resetting STM32, reconnecting in 20 seconds ...</B><BR>\r\n");
            end_box ();
            http_trailer ();
            http_flush ();
            delay (200);
            stm32_reset ();
            return 0;
        }

        http_header("Local Update", NULL, NULL);
        begin_box ("Local Update");

        http_send_FS (
                "<br/>Please select the STM32 firmware file<br/>"
                "<form method='post' action='flash_stm32_local' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label><br /><br />"
                "<input type='submit' class='button' name='submit' value='Update STM32'>"
                "</form>"
                );
        reset_button ();
    }
    else
    {
        http_header("Local Update", NULL, NULL);
        begin_box ("Local Update");
        http_send_FS ("<font color=red><B>Flash size of ESP8266 is too small for Local Update over OTA</B></font><BR>\r\n");
    }

    end_box ();
    http_trailer();
    http_flush ();
    return 0;
}

static int
http_api_stm32_log ()
{
    uint16_t idx;
    uint16_t count = stm32_log_get_count ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"count\":"));
    http_send (String(count));
    http_send (FS(",\"lines\":["));

