granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    for (idx = 0; idx < count; idx++)
    {
        if (idx > 0)
        {
            http_send (FS(","));
        }

        http_send (FS("\""));
        http_send_json_escaped (stm32_log_get_line (idx));
        http_send (FS("\""));
    }

    http_send (FS("]}"));
    http_flush ();
    return 0;
}

static int
http_api_stm32_log_clear ()
{
    stm32_log_clear ();
    http_json_ok ();
    return 0;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * http server
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
uint_fast8_t
http (const char * path, const char * const_param)
{
    char param[256];

    strncpy (param, const_param, 255);
    param[255] = '\0';

    char *          p;
    int             rtc = 0;

    // log_printf ("http path: '%s'\r\n", path);

    for (p = param; *p; p++)
    {
        if (*p == '+')                                      // plus must be mapped to space if GET method
        {
            *p = ' ';
        }
    }

    // log_printf ("http parameters: '%s'\r\n", param);

    if (param[0])
    {
        http_set_params (param);
    }
    else
    {
        http_set_params ((char *) NULL);
    }

    if (hardware_configuration == 0xFFFF)
    {
        hardware_configuration = get_numvar (HARDWARE_CONFIGURATION_NUM_VAR);

        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                pgm_name        = "WordClock";
                hardware        = "WC24h";
                break;
            case HW_WC_12H:
                pgm_name        = "WordClock";
                hardware        = "WC12h";
                break;
            case HW_UCLOCK:
                pgm_name        = "uClock";
                hardware        = "uClock";
                break;
        }
    }

    if (! strcmp (path, "/"))
    {
        rtc = http_main ();
    }
    else if (! strcmp (path, "/network"))
    {
        rtc = http_network ();
    }
    else if (! strcmp (path, "/temperature"))
    {
        rtc = http_temperature ();
    }
    else if (! strcmp (path, "/weather"))
    {
        rtc = http_weather ();
    }
    else if (! strcmp (path, "/ldr"))
    {
        rtc = http_ldr ();
    }
    else if (! strcmp (path, "/dispbright"))
    {
        rtc = http_display_brightness ();
    }
    else if (! strcmp (path, "/ambibright"))
    {
        rtc = http_ambilight_brightness ();
    }
    else if (! strcmp (path, "/display"))
    {
        rtc = http_display ();
    }
    else if (! strcmp (path, "/animations"))
    {
        rtc = http_animations ();
    }
    else if (! strcmp (path, "/overlays"))
    {
        rtc = http_overlays ();
    }
    else if (! strcmp (path, "/ambilight"))
    {
        rtc = http_ambilight ();
    }
    else if (! strcmp (path, "/timers"))
    {
        rtc = http_timers (0);
    }
    else if (! strcmp (path, "/atimers"))
    {
        rtc = http_timers (1);
    }
    else if (! strcmp (path, "/dfplayer"))
    {
        rtc = http_dfplayer ();
    }
    else if (! strcmp (path, "/tft"))
    {
        rtc = http_tft ();
    }
    else if (! strcmp (path, "/fs"))
    {
        rtc = http_fs ();
    }
    else if (! strcmp (path, "/update"))
    {
        rtc = http_update ();
    }
    else if (! strcmp (path, "/flash_stm32_local"))
    {
        rtc = flash_stm32_local ();
    }
    else if (! strcmp (path, PWA_PREFIX) || ! strcmp (path, PWA_PREFIX "/") ||
             ! strncmp (path, PWA_PREFIX "/", strlen (PWA_PREFIX "/")))
    {
        rtc = http_app (path);
    }
    else if (! strcmp (path, "/get_settings"))
    {
        rtc = http_get_settings ();
    }
    else if (! strcmp (path, "/display_power"))
    {
        rtc = http_get_display_power ();
    }
    else if (! strcmp (path, "/ambilight_power"))
    {
        rtc = http_get_ambilight_power ();
    }
    else if (! strcmp (path, "/api/display_power_set"))
    {
        rtc = http_api_display_power_set ();
    }
    else if (! strcmp (path, "/api/ambilight_power_set"))
    {
        rtc = http_api_ambilight_power_set ();
    }
    else if (! strcmp (path, "/api/display_brightness_set"))
    {
        rtc = http_api_display_brightness_set ();
    }
    else if (! strcmp (path, "/api/auto_brightness_set"))
    {
        rtc = http_api_auto_brightness_set ();
    }
    else if (! strcmp (path, "/api/display_mode_set"))
    {
        rtc = http_api_display_mode_set ();
    }
    else if (! strcmp (path, "/api/display_it_is_set"))
    {
        rtc = http_api_display_it_is_set ();
    }
    else if (! strcmp (path, "/api/ticker_set"))
    {
        rtc = http_api_ticker_set ();
    }
    else if (! strcmp (path, "/api/date_ticker_format_set"))
    {
        rtc = http_api_date_ticker_format_set ();
    }
    else if (! strcmp (path, "/api/ticker_deceleration_set"))
    {
        rtc = http_api_ticker_deceleration_set ();
    }
    else if (! strcmp (path, "/api/test_display"))
    {
        rtc = http_api_test_display ();
    }
    else if (! strcmp (path, "/api/weather_appid_set"))
    {
        rtc = http_api_weather_appid_set ();
    }
    else if (! strcmp (path, "/api/weather_city_set"))
    {
        rtc = http_api_weather_city_set ();
    }
    else if (! strcmp (path, "/api/weather_coordinates_set"))
    {
        rtc = http_api_weather_coordinates_set ();
    }
    else if (! strcmp (path, "/api/weather_get_now"))
    {
        rtc = http_api_weather_get_now ();
    }
    else if (! strcmp (path, "/api/weather_get_forecast"))
    {
        rtc = http_api_weather_get_forecast ();
    }
    else if (! strcmp (path, "/api/network_scan"))
    {
        rtc = http_api_network_scan ();
    }
    else if (! strcmp (path, "/api/eeprom_settings"))
    {
        rtc = http_api_eeprom_settings ();
    }
    else if (! strcmp (path, "/api/eeprom_settings_set"))
    {
        rtc = http_api_eeprom_settings_set ();
    }
    else if (! strcmp (path, "/api/stm32_log"))
    {
        rtc = http_api_stm32_log ();
    }
    else if (! strcmp (path, "/api/stm32_log_clear"))
    {
        rtc = http_api_stm32_log_clear ();
    }
    else if (! strcmp (path, "/api/network_client_set"))
    {
        rtc = http_api_network_client_set ();
    }
    else if (! strcmp (path, "/api/network_ap_set"))
    {
        rtc = http_api_network_ap_set ();
    }
    else if (! strcmp (path, "/api/network_timeserver_set"))
    {
        rtc = http_api_network_timeserver_set ();
    }
    else if (! strcmp (path, "/api/network_timezone_set"))
    {
        rtc = http_api_network_timezone_set ();
    }
    else if (! strcmp (path, "/api/network_summertime_set"))
    {
        rtc = http_api_network_summertime_set ();
    }
    else if (! strcmp (path, "/api/network_get_time"))
    {
        rtc = http_api_network_get_time ();
    }
    else if (! strcmp (path, "/api/network_wps"))
    {
        rtc = http_api_network_wps ();
    }
    else if (! strcmp (path, "/api/update_host_set"))
    {
        rtc = http_api_update_host_set ();
    }
    else if (! strcmp (path, "/api/update_path_set"))
    {
        rtc = http_api_update_path_set ();
    }
    else if (! strcmp (path, "/api/update_status"))
    {
        rtc = http_api_update_status ();
    }
    else if (! strcmp (path, "/api/update_table_files"))
    {
        rtc = http_api_update_table_files ();
    }
    else if (! strcmp (path, "/api/update_download_assets"))
    {
        rtc = http_api_update_download_assets ();
    }
    else if (! strcmp (path, "/api/update_download_app_bundle"))
    {
        rtc = http_api_update_download_app_bundle ();
    }
    else if (! strcmp (path, "/api/maintenance_format_fs"))
    {
        rtc = http_api_maintenance_format_fs ();
    }
    else if (! strcmp (path, "/api/maintenance_reset_stm32"))
    {
        rtc = http_api_maintenance_reset_stm32 ();
    }
    else if (! strcmp (path, "/api/maintenance_reset_eeprom"))
    {
        rtc = http_api_maintenance_reset_eeprom ();
    }
    else if (! strcmp (path, "/api/datetime_set"))
    {
        rtc = http_api_datetime_set ();
    }
    else if (! strcmp (path, "/api/learn_ir"))
    {
        rtc = http_api_learn_ir ();
    }
    else if (! strcmp (path, "/api/temperature_display"))
    {
        rtc = http_api_temperature_display ();
    }
    else if (! strcmp (path, "/api/temperature_rtc_correction_set"))
    {
        rtc = http_api_temperature_rtc_correction_set ();
    }
    else if (! strcmp (path, "/api/temperature_ds18xx_correction_set"))
    {
        rtc = http_api_temperature_ds18xx_correction_set ();
    }
    else if (! strcmp (path, "/api/ldr_min_set"))
    {
        rtc = http_api_ldr_min_set ();
    }
    else if (! strcmp (path, "/api/ldr_min_value_set"))
    {
        rtc = http_api_ldr_min_value_set ();
    }
    else if (! strcmp (path, "/api/ldr_max_set"))
    {
        rtc = http_api_ldr_max_set ();
    }
    else if (! strcmp (path, "/api/ldr_max_value_set"))
    {
        rtc = http_api_ldr_max_value_set ();
    }
    else if (! strcmp (path, "/api/animation_mode_set"))
    {
        rtc = http_api_animation_mode_set ();
    }
    else if (! strcmp (path, "/api/color_animation_mode_set"))
    {
        rtc = http_api_color_animation_mode_set ();
    }
    else if (! strcmp (path, "/api/animation_profile_set"))
    {
        rtc = http_api_animation_profile_set ();
    }
    else if (! strcmp (path, "/api/animation_profile_default"))
    {
        rtc = http_api_animation_profile_default ();
    }
    else if (! strcmp (path, "/api/color_animation_profile_set"))
    {
        rtc = http_api_color_animation_profile_set ();
    }
    else if (! strcmp (path, "/api/color_animation_profile_default"))
    {
        rtc = http_api_color_animation_profile_default ();
    }
    else if (! strcmp (path, "/api/display_dim_level_set"))
    {
        rtc = http_api_display_dim_level_set ();
    }
    else if (! strcmp (path, "/api/ambilight_dim_level_set"))
    {
        rtc = http_api_ambilight_dim_level_set ();
    }
    else if (! strcmp (path, "/api/tft_flags_set"))
    {
        rtc = http_api_tft_flags_set ();
    }
    else if (! strcmp (path, "/api/ambilight_brightness_set"))
    {
        rtc = http_api_ambilight_brightness_set ();
    }
    else if (! strcmp (path, "/api/ambilight_mode_set"))
    {
        rtc = http_api_ambilight_mode_set ();
    }
    else if (! strcmp (path, "/api/ambilight_leds_set"))
    {
        rtc = http_api_ambilight_leds_set ();
    }
    else if (! strcmp (path, "/api/ambilight_offset_set"))
    {
        rtc = http_api_ambilight_offset_set ();
    }
    else if (! strcmp (path, "/api/ambilight_mode_profile_set"))
    {
        rtc = http_api_ambilight_mode_profile_set ();
    }
    else if (! strcmp (path, "/api/ambilight_mode_profile_default"))
    {
        rtc = http_api_ambilight_mode_profile_default ();
    }
    else if (! strcmp (path, "/api/display_color_set"))
    {
        rtc = http_api_display_color_set ();
    }
    else if (! strcmp (path, "/api/ambilight_color_set"))
    {
        rtc = http_api_ambilight_color_set ();
    }
    else if (! strcmp (path, "/api/marker_color_set"))
    {
        rtc = http_api_marker_color_set ();
    }
    else if (! strcmp (path, "/api/sync_ambilight_set"))
    {
        rtc = http_api_sync_ambilight_set ();
    }
    else if (! strcmp (path, "/api/sync_markers_set"))
    {
        rtc = http_api_sync_markers_set ();
    }
    else if (! strcmp (path, "/api/fade_clock_seconds_set"))
    {
        rtc = http_api_fade_clock_seconds_set ();
    }
    else if (! strcmp (path, "/api/ambilight_markers_set"))
    {
        rtc = http_api_ambilight_markers_set ();
    }
    else if (! strcmp (path, "/api/ambilight_online_set"))
    {
        rtc = http_api_ambilight_online_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_volume_set"))
    {
        rtc = http_api_dfplayer_volume_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_mode_set"))
    {
        rtc = http_api_dfplayer_mode_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_bell_flags_set"))
    {
        rtc = http_api_dfplayer_bell_flags_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_speak_cycle_set"))
    {
        rtc = http_api_dfplayer_speak_cycle_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_silence_start_set"))
    {
        rtc = http_api_dfplayer_silence_start_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_silence_stop_set"))
    {
        rtc = http_api_dfplayer_silence_stop_set ();
    }
    else if (! strcmp (path, "/api/dfplayer_play"))
    {
        rtc = http_api_dfplayer_play ();
    }
    else if (! strcmp (path, "/api/dfplayer_alarm_set"))
    {
        rtc = http_api_dfplayer_alarm_set ();
    }
    else if (! strcmp (path, "/api/overlay_set"))
    {
        rtc = http_api_overlay_set ();
    }
    else if (! strcmp (path, "/api/overlay_display"))
    {
        rtc = http_api_overlay_display ();
    }
    else if (! strcmp (path, "/api/overlay_delete"))
    {
        rtc = http_api_overlay_delete ();
    }
    else if (! strcmp (path, "/api/timer_set"))
    {
        rtc = http_api_timer_set ();
    }
    else if (! strcmp (path, "/api/ambilight_timer_set"))
    {
        rtc = http_api_ambilight_timer_set ();
    }
    else if (! strcmp (path, "/api/overlay_icons"))
    {
        rtc = http_api_overlay_icons ();
    }
    else if (! strcmp (path, "/api/fs_info"))
    {
        rtc = http_api_fs_info ();
    }
    else if (! strcmp (path, "/api/fs_list"))
    {
        rtc = http_api_fs_list ();
    }
    else if (! strcmp (path, "/api/fs_show"))
    {
        rtc = http_api_fs_show ();
    }
    else if (! strcmp (path, "/api/fs_remove"))
    {
        rtc = http_api_fs_remove ();
    }
    else if (! strcmp (path, "/api/local_stm32_flash"))
    {
        rtc = http_api_local_stm32_flash ();
    }
    else if (! strcmp (path, "/api/local_esp_restart"))
    {
        rtc = http_api_local_esp_restart ();
    }
    else
    {
        const char * p = "HTTP/1.0 404 Not Found";
        http_send (p);
        http_send_FS ("\r\n\r\n404 Not Found\r\n");
        http_flush ();
    }

