granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return rtc;
}

void
http_post(const String& sPath)
{
    if (sPath == "/flash_stm32_local")
    {
        flash_stm32_local (true);
    }
    else if (sPath == "/fs-icon")
    {
        http_fs (POST_ICON_FILE);
    }
    else if (sPath == "/fs-icon-weather")
    {
        http_fs (POST_ICON_WEATHER_FILE);
    }
    else if (sPath == "/fs-tables")
    {
        http_fs (POST_TABLES_FILE);
    }
    else if (sPath == "/fs-display")
    {
        http_fs (POST_DISPLAY_FILE);
    }
    else if (sPath == "/fs-app-bundle")
    {
        http_fs (POST_APP_BUNDLE_FILE);
    }
    else if (sPath == "/api/local_stm32_upload")
    {
        http_api_local_stm32_upload ();
    }
    else if (sPath == "/api/local_esp_update")
    {
        http_api_local_esp_update ();
    }
}

/*----------------------------------------------------------------------------------------------------------------------------------------
 * http server
 *----------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_server_loop (void)
{
    String  sPath       = "";
    String  sParam      = "";
    String  sCmd        = "";
    String  sGetstart   = "GET ";
    String  sPoststart  = "POST ";
    String  sResponse   = "";
    int     start_position;
    int     end_position_space;
    int     end_position_question;

    http_client = http_server.accept();                                     // check if a client has connected

    if (!http_client)                                                       // wait until the client sends some data
    {
        return;
    }

    Serial.println("- new client");
    Serial.flush ();

    unsigned long ultimeout = millis() + 250;

    while (! http_client.available() && (millis() < ultimeout) )
    {
        delay(1);
    }

    if (millis() > ultimeout)
    {
        Serial.println ("- client connection time-out!");
        Serial.flush ();
        return;
    }
    http_client.setNoDelay(1);

    String sRequest = http_client.readStringUntil ('\r');                   // read the first line of the request

    if (sRequest == "")                                                     // stop client, if request is empty
    {
        Serial.println ("- empty http request");
        Serial.flush ();
        while (http_client.available())                                     // firefox claims about connection reset, if we do not read all characters
        {
            http_client.read();
        }
        http_client.stop();
        return;
    }

    // POST
    start_position = sRequest.indexOf(sPoststart);

    if (start_position == 0)
    {
        start_position += sPoststart.length ();
        end_position_space = sRequest.indexOf (" ", start_position);

        sPath  = sRequest.substring(start_position, end_position_space);
        http_post (sPath);
    }
    else // GET
    {
        start_position = sRequest.indexOf(sGetstart);

        if (start_position >= 0)
        {
            start_position += sGetstart.length ();
            end_position_space = sRequest.indexOf (" ", start_position);
            end_position_question = sRequest.indexOf ("?", start_position);

            if (end_position_space > 0)                                         // parameters?
            {
                if (end_position_question > 0)
                {                                                               // yes
                    sPath  = sRequest.substring(start_position, end_position_question);
                    sParam = sRequest.substring(end_position_question + 1, end_position_space);
                }
                else
                {                                                               // no
                    sPath  = sRequest.substring(start_position, end_position_space);
                }
            }
        }

        http (sPath.c_str(), sParam.c_str());
    }

    http_client.flush();

    while (http_client.available())                                         // firefox claims about connection reset, if we do not read all characters
    {
        http_client.read();
    }

    http_client.stop();                                                     // stop client
}

/*----------------------------------------------------------------------------------------------------------------------------------------
 * http server begin
 *----------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_server_begin (void)
{
    http_server.begin();
}
